{
  "name": "Saurabh Bhausaheb Zinjad",
  "summary": "Versatile and self-driven professional with 4+ years of industrial experience in crafting production-ready ML Architecture and full-stack softwares through coherent analysis, and relentless focus on efficient solutions with meticulous execution.",
  "phone-no": "+1 480 913 5544",
  "email": "saurabhzinjad@asu.edu",
  "media": {
    "linkedin": "linkedin.com/in/saurabhzinjad",
    "github": "github.com/Ztrimus",
    "devpost": "devpost.com/Ztrimus",
    "medium": "ztrimus.medium.com",
    "leetcode": "leetcode.com/Ztrimus",
    "dagshub": "https://dagshub.com/Ztrimus",
    "kaggle": "https://www.kaggle.com/ztrimus",
    "instagram": "https://www.instagram.com/saurabh_zinjad/"
  },
  "cover-letter-guideline": [
  ],
  "education": [
    {
      "degree": "Masters of Science in Computer Science",
      "university": "Arizona State University, Tempe, USA",
      "from": "Aug 2023",
      "to": "May 2025",
      "grade": "3.8/4",
      "coursework": [
        "Social Media Mining",
        "Knowledge Representation and Reasoning Algorithms",
        "Statistical Machine Learning"
      ]
    },
    {
      "degree": "Bachelor of Engineering",
      "university": "Pune Institute of Computer Technology(PICT), Savitribai Phule Pune University, India",
      "from": "Jul 2015",
      "to": "Jun 2019",
      "grade": "8.53/10",
      "classes": [
        "DSA",
        "OOP",
        "OS",
        "System Programming",
        "Computer Networks",
        "AI",
        "ML",
        "Digital Video & Image Processing"
      ]
    }
  ],
  "skill-section": [
    {
      "name": "Programming Languages",
      "skills": [
        "Python",
        "JavaScript",
        "C#",
        "C++",
        "SQL",
        "R",
        "Java",
        "Shell Scripting"
      ]
    },
    {
      "name": "Data Science",
      "skills": [
        "Databricks",
        "PySpark",
        "TensorFlow",
        "PyTorch",
        "MXNet",
        "OpenCV",
        "Scikit Learn",
        "Pandas",
        "Matplotlib",
        "Keras"
      ]
    },
    {
      "name": "Cloud and DevOps",
      "skills": [
        "Azure",
        "AWS",
        "Docker",
        "Kubernetes",
        "MLFlow",
        "Jupyter Notebook",
        "Git"
      ]
    },
    {
      "name": "Full-Stack Tech",
      "skills": [
        "Angular",
        "React",
        ".Net Core",
        "NodeJs",
        "Django",
        "Flask",
        "FastAPI",
        "MongoDB",
        "SQL Server",
        "MySQL",
        "Postman"
      ]
    }
  ],
  "work": [
    {
      "role": "Senior Machine Learning Engineer",
      "company": "Tiger Analytics, Bangalore, India",
      "from": "Jun 2022",
      "to": "Jul 2023",
      "description": [
        "Spearheaded development of Data & CI/CD pipelines, Interactive Dashboards, Constraint-based ML Models, Web App, and Comprehensive Documentation for MSP Value Optimization in Petcare sector with a team of 8 analysts. (Team Leadership)",
        "Developed MLCORE product (end-to-end MLOps platform) by implementing research ideas, organizing through prototyping, and Integrating it with numerous cloud services, attracting an additional four significant clients. (Interpersonal Skills)" 
      ]
    },
    {
      "role": "Software Engineer",
      "company": "Winjit Technologies, Pune, India",
      "from": "Jan 2020",
      "to": "Jun 2022",
      "description": [
        "Engineered 10+ RESTful APIs Architecture and Distributed services; Designed 30+ low-latency responsive UI/UX application features with high-quality web architecture; Managed and optimized large-scale Databases. (Systems Design)",  
        "Initiated and Designed a standardized solution for dynamic forms generation, with customizable CSS capabilities feature, which reduces development time by 8x; Led and collaborated with a 12 member cross-functional team. (Idea Generation)"  
      ]
    },
    {
      "role": "Deep Learning Engineer",
      "company": "Automation Teknix, Pune, India",
      "from": "Sept 2019",
      "to": "Jan 2020",
      "description": [
        "Devised a Lightweight Object Recognition Engine with a low computational cost by leveraging an SSD algorithm with MobilenetV2 architecture, which decreased survey error by 22%. (Problem Identification)",
        "Conducted thorough Initial research; prototyped neural network flow; conceptualized POC, training, and monitoring of models. This resulted in a 7% increase in accuracy and reduced inference time by 2x. (Experiment Design)"
      ]
    },
    {
      "role": "Research Intern",
      "company": "IMATMI, Robbinsville, New Jersey (Remote)",
      "from": "Mar 2019",
      "to": "Aug 2019",
      "description": [
        "Conducted research and developed a range of ML and statistical models to design analytical tools and streamline HR processes, optimizing talent management systems for increased efficiency.",
        "Created 'goals and action plan generation' tool for employees, considering their weaknesses to facilitate professional growth.",
        "Implemented an automated system to identify 'best-fit employees' for upcoming projects, improving project outcomes and resource allocation for managers."
      ]
    }
  ],
  "projects": [
    {
      "name": "Streamlining Job Applications with LLM Automation Pipeline",
      "type": "Project",
      "link": "https://pypi.org/project/zlm/",
      "from": "Oct 2023",
      "to": "Dec 2023",
      "description": [
        "Make your job hunting experience easier by using LLMs to automate tasks like creating personalized resumes and cover letters tailored to specific jobs, as well as submitting applications, saving users time and effort.",
        "Developed Python library to optimize the job application workflow that generates curated resumes and personalized cover letters tailored to specific job roles.",
        "Utilized advanced techniques including Prompt Engineering, Web Scraping, and integration of various Large Language Models to enhance the effectiveness of the application."
      ]
    },
    {
      "name": "Search Engine for All file types - Sunhack Hackathon - Meta & Amazon Sponsored",
      "type": "Hackathon",
      "link": "https://devpost.com/software/team-soul-1fjgwo",
      "from": "Nov 2023",
      "to": "Nov 2023",
      "description": [
        "Big Data Awards in Python FAST API and angular development, providing efficient data access and retrieval.",
        "Converted and stored every file type data as vector embeddings, ensuring low-latency search capabilities.",
        "Used Machine Learning techniques such as BERT, OCR, ResNet50, and Image Captioning to parse Image features.",
        "Contributed to Elasticsearch implementation for blazing-fast search responses, with millisecond response times."
      ]
    },
    {
      "name": "GenAI’s Capabilities and Boundaries Exploration - Prompt Engineering Hackathon for Humanities",
      "type": "Hackathon",
      "link": "https://www.linkedin.com/pulse/exploring-depths-ai-story-writing-prompt-engineering-hackathon-wbqwc",
      "from": "Oct 2023",
      "to": "Oct 2023",
      "description": [
        "1st runner up prize in crafted AI persona, to explore LLM's subtle contextual understanding and create innovative collaborations between humans and machines.",
        "Addressed limitations in narrative flow, simplicity, emotional depth, and hallucinations through innovative approaches.",
        "Demonstrated creative mindset and ability to navigate complex tasks and adapt to evolving requirements during hackathon."
      ]
    },
    {
      "name": "Forest Fire Detection using IoT Sensor Data",
      "type": "Industrial Project",
      "link": "https://github.com/OmdenaAI/Dryad",
      "from": "Sept 2021",
      "to": "Jan 2022",
      "description": [
        "Devised a TabNet Classifier Model having 98.7% accuracy in detecting forest fire through IoT sensor data, deployed on AWS and edge devices 'Silvanet Wildfire Sensors' using technologies TinyML, Docker, Redis, and celery.",
        "Examine and utilize many performance metrics (Recall, F2 score, sensitivity, specificity. etc.) to reduce high type II error.",
        "Performed Model Exploration, Analysis, and Optimization."
      ]
    },
    {
      "name": "Stock Market Analysis",
      "type": "Intern Project",
      "link": "https://github.com/Ztrimus/Stock-Market-Analysis",
      "from": "Dec 2018",
      "to": "Feb 2019",
      "description": [
        "Conducted in-depth Exploratory Data Analysis (EDA) and utilized data visualization techniques for comprehensive stock market analysis. Implemented a range of statistical and ML models on diverse time-series stocks to extract insights and predictions. Improved performance by 27% on the “clustering and diversification analysis”."  
      ]
    },
    {
      "name": "Autonomous Surveillance Monitoring System",
      "type": "Project",
      "link": "",
      "from": "Feb 2019",
      "to": "Jun 2019",
      "description": [
        "At a college-sponsored project, I Built a surveillance engine to detect and alert about suspicious behaviors on campus by constructing a computer vision pipeline of CCTV footage data processing, face detection, poses & action recognition using OpenCV, MediaPipe, Tensorflow, MLFlow, and Flask. Finally, We deployed it on college premises."
      ]
    },
    {
      "name": "Speech Emotion Recognition",
      "type": "Project",
      "link": "https://github.com/Ztrimus/speech-emotion-recognition",
      "from": "Nov 2018",
      "to": "Feb 2019",
      "description": [
        "Researched and optimized existing emotion detection approaches by combining CNN and LSTM networks. Discovered emotion-affecting attributes in voice by analyzing audio signal features-MFCC, ZCR, Pitch, and Chroma.",
        "Compressed audio data using an Autoencoder technique to avoid data loss. Due to this, we were able to boost the accuracy of the speech model by 31%. Used tools like PyTorch, Librosa, puAudioAnalysis, and Tensorboard."  
      ]
    },
    {
      "name": "Homecoming: Animal Habitat Organization",
      "type": "Project",
      "link": "",
      "from": "Aug 2018",
      "to": "Jan 2019",
      "description": [
        "Developed a Custom Animal Identification and Classification model using Faster R-CNN architecture to identify animals and their habitats in a simulated environment, which Integrated it into the Firebird V ATMEGA2560 Robot (we tailored it to put animals into a habitat). Optimized the \"Region Proposal Network\" component resulting in 35% decrease in processing time."    
      ]
    }
  ],
  "certifications": [
    {
      "name": "Deep Learning Specialization",
      "by": "DeepLearning.AI, Coursera Inc.",
      "link": "https://www.coursera.org/account/accomplishments/specialization/G3WPNWRYX628"
    },
    {
      "name": "MLOps for AI Engineers and Data Scientists",
      "by": "Omdena Inc.",
      "link": "https://drive.google.com/file/d/1fh4AEscb0P82nfoaA-muWMzmFngzyk2g/view"
    },
    { "name": "Microsoft Azure Fundamentals", "by": "Udemy.",
    "link": "https://www.udemy.com/certificate/UC-37e943d1-e7f7-4d27-a1e4-e799aef7013b/" },
    {
      "name": "Server-side Backend Development",
      "by": "The Hong Kong University of Science and Technology.",
      "link": "https://www.coursera.org/account/accomplishments/verify/TYMQX23D4HRQ"
    },
    {
      "name": "Front-End Web UI Frameworks and Tools",
      "by": "The Hong Kong University of Science and Technology.",
      "link": "https://www.coursera.org/account/accomplishments/verify/TW8MA6MEXSCZ"
    }
  ],
  "achievements": [
    "1st runner-up in “Prompt Engineering Hackathon 2023 for Humanities”",
    "Received the 'Extra Miller - 2021' award at Winjit Technologies for outstanding performance. ",
    "President of Machine Learning Club: Led a team of 20 people in a project and was awarded \"Best Project of the Year.\"",
    "Finalist in E-yantra Robotics Competition 2018 - IITB.",
    "Dance Section's Head of PICT Art Circle: Best dance choreography for Winning \"Firodiya theater competition 2019.\"",
    "Performed in multiple award-winning state-level drama competitions and received the best-organized team prize thrice.",
    "An active member of the NSS (National Community Service Group in PICT) in 2016."
  ]
}