{
  "title": "Software Developer - Consulting Internship Summer 2024",
  "keywords": [
    "software developer",
    "consulting internship",
    "summer 2024",
    "Baton Rouge"
  ],
  "purpose": "To support software development projects through requirement gathering, project planning, system documentation, and application testing.",
  "duties_responsibilities": [
    "Perform routine assignments in support of the department and Firm strategic plan",
    "Work closely with project managers, developers, and stakeholders to understand and design business system's functional and nonfunctional requirements",
    "Support application testing and application users post implementation",
    "Contribute to reporting and custom developed IT projects",
    "Participate in software testing including Quality Assurance and Quality Control",
    "Communicate any obstacles or items of concern to supervisor",
    "Comply with professional and Firm requirements",
    "Attend training sessions or meetings as required",
    "Maintain a positive attitude and be receptive to feedback"
  ],
  "required_qualifications": [
    "Working towards a Bachelor's or Masters of Science degree in Computer Science, Information Systems and Decision Sciences, Accounting, Finance or a related field",
    "3.0 GPA preferred",
    "No certification required",
    "Direct experience or education related to Agile software development cycles, software development, design and/or testing preferred",
    "Experience or education related to project management, process management preferred",
    "Experience or education related to technical writing or requirements gathering preferred",
    "Experience with JIRA, Confluence, or related IT Project Management programs preferred",
    "Working knowledge of Scrum or other Agile methodologies",
    "Able to work in a dynamic, fast-paced, innovative, and continuously changing environment",
    "Excellent communication skills in business and technical environments"
  ],
  "preferred_qualifications": [],
  "company_info": "EisnerAmper is one of the largest accounting, tax, and business advisory firms, with nearly 4,000 employees and more than 350 partners across the world. Our clients are enterprises as diverse as sophisticated financial institutions and start-ups, global public firms and middle-market companies, as well as high net worth individuals, family offices, not-for-profit organizations, and entrepreneurial ventures across a variety of industries. We have offices in the United Kingdom, Israel, India, the Cayman Islands, Singapore, and Ireland."
}