{
  "title": "Software Developer - Consulting Internship Summer 2024",
  "keywords": [
    "Software Developer",
    "Consulting Internship",
    "Summer 2024",
    "Baton Rouge"
  ],
  "purpose": "To support software development projects by gathering requirements, designing systems, and assisting in the development and testing process.",
  "duties_responsibilities": [
    "Supports software development projects through requirement gathering, project planning, and system documentation.",
    "Supports the design and creation of software development screens with wireframes and mock-ups.",
    "Assists in conceptualizing and developing new business workflows or system processes.",
    "Collaborates with project managers to define project vision, organize tasks, and track progress.",
    "Contributes to reporting and custom IT projects, performing software development testing.",
    "Participates in software testing, including Quality Assurance and Quality Control.",
    "Communicates obstacles or concerns to supervisor.",
    "Complies with professional and firm requirements.",
    "Attends training sessions or meetings as required.",
    "Maintains a positive attitude and is receptive to feedback.",
    "Provides courteous and prompt service to internal and external parties.",
    "Identifies opportunities to improve service and work processes.",
    "Assists coworkers and supports teamwork throughout the organization.",
    "May be required to travel and work from different company locations.",
    "May be required to work overtime or on weekends as needed."
  ],
  "required_qualifications": [
    "Working towards a Bachelor’s or Masters of Science degree in Computer Science, Information Systems and Decision Sciences, Accounting, Finance, or a related field.",
    "3.0 GPA is preferred, but not required.",
    "No certification required.",
    "Experience or education related to Agile software development cycles, software development, design and/or testing is preferred.",
    "Experience or education related to project management or process management is preferred.",
    "Experience or education related to technical writing or requirements gathering is preferred.",
    "Experience with JIRA, Confluence, or related IT Project Management programs is preferred.",
    "Working knowledge of Scrum or other Agile methodologies.",
    "Ability to work in a dynamic, fast-paced, innovative, and continuously changing environment.",
    "Excellent communication skills in business and technical environments."
  ],
  "preferred_qualifications": [],
  "company_name": "EisnerAmper",
  "company_info": {
    "overview": "One of the largest accounting, tax, and business advisory firms with a global presence.",
    "mission": "To help clients meet current challenges and position them for future success.",
    "values": "Responsiveness, long-term perspective, diversity, equity, and inclusion.",
    "way_of_working": "Combination of professional expertise, innovative solutions, and a commitment to client satisfaction."
  }
}
