{
  "title": "Software Developer - Consulting Internship",
  "keywords": [
    "Software Developer",
    "Consulting Internship",
    "Summer 2024",
    "Baton Rouge"
  ],
  "purpose": "To support software development projects and assist with requirement gathering, project planning, system documentation, and application testing.",
  "duties_responsibilities": [
    "Support software development projects through requirement gathering, project planning, and system documentation",
    "Support the design and creation of software development screens with wireframes and mock-ups",
    "Assist in conceptualizing and developing new business workflows or system processes",
    "Collaborate with project managers in defining project vision, organizing project tasks, and tracking project progress",
    "Contribute to reporting and custom developed IT projects, perform software development testing, unit testing, and debugging",
    "Participate in software testing including Quality Assurance and Quality Control",
    "Support the creation and execution of manual software testing scripts",
    "Communicate obstacles or items of concern to supervisor",
    "Comply with professional and Firm requirements, quality control document requirements, and confidentiality requirements",
    "Attend and actively engage in training sessions or meetings",
    "Maintain a positive attitude and be receptive to feedback",
    "Provide courteous and prompt service to all internal and external parties",
    "Identify opportunities to improve service and work processes",
    "Assist co-workers in the completion of tasks and assignments",
    "May periodically travel and work from different company locations",
    "May be required to work overtime and/or on weekends as needed"
  ],
  "required_qualifications": [
    "Working towards a Bachelor’s or Masters of Science degree in Computer Science, Information Systems and Decision Sciences, Accounting, Finance or a related field",
    "3.0 GPA is preferred, but not required",
    "No certification required",
    "Direct experience or education related to Agile software development cycles, software development, design, and/or testing is preferred",
    "Experience or education related to project management, process management is preferred",
    "Experience or education related to technical writing or requirements gathering is preferred",
    "Experience with JIRA, Confluence, or related IT Project Management programs is preferred",
    "Working knowledge of Scrum or other Agile methodologies",
    "Able to work in a dynamic, fast-paced, innovative, and continuously changing environment",
    "Excellent communication skills in business and technical environments"
  ],
  "preferred_qualifications": [],
  "company_name": "EisnerAmper",
  "company_info": {
    "overview": "EisnerAmper is one of the largest accounting, tax, and business advisory firms, with nearly 4,000 employees and more than 350 partners across the world. We combine responsiveness with a long-range perspective to help clients meet the pressing issues they face today and position them for success tomorrow.",
    "mission": "To provide exceptional accounting, tax, and business advisory services to clients, and to create a supportive and inclusive work environment for our employees.",
    "values": "Responsiveness, Long-range perspective, Exceptional service, Supportive and inclusive work environment",
    "way_of_working": "EisnerAmper values collaboration, innovation, and continuous learning. We encourage our employees to take ownership of their work, communicate effectively, and strive for excellence in everything they do."
  }
}
